Catalogs/МаршрутыТранспортныхКомпаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МаршрутыТранспортныхКомпаний</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиныйТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаНДС</Name>
					<Comment>Вариант расчета НДС!</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛюбойИзСкладов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устаревший</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоставкаНаСклад</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ВодителиПоМаршруту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВодителиПоМаршруту</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
						<v8:Type>cfg:CatalogRef.МаршрутыТранспортныхКомпаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/МаршрутыТранспортныхКомпаний/Forms/ФормаСменыВодителя/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьПеревозчикаМаршрута(ТекМаршрут)
	
	Возврат ТекМаршрут.Перевозчик;
	
КонецФункции

Процедура ПерезаписатьМаршруты()
	
	РегСвВодителиПоМаршруту = РегистрыСведений.ВодителиПоМаршруту;
	ТекПеревозчик = ЭтаФорма.Автомобиль.Перевозчик;
	
	Для Каждого СтрокаТаблицы Из ЭтаФорма.ТаблицаМаршрутов Цикл
		
		ТекМаршрут = СтрокаТаблицы.Маршрут;
		Если ТекМаршрут.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ТекМаршрут.Перевозчик = ТекПеревозчик Тогда
			ОбъектМаршрута = ТекМаршрут.ПолучитьОбъект();
			ОбъектМаршрута.Перевозчик = ТекПеревозчик;
			Попытка
				ОбъектМаршрута.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		МенеджерЗаписи = РегСвВодителиПоМаршруту.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период 		= ТекущаяДата();
		МенеджерЗаписи.Маршрут 		= ТекМаршрут;
		МенеджерЗаписи.Водитель 	= ЭтаФорма.Водитель;
		МенеджерЗаписи.Автомобиль 	= ЭтаФорма.Автомобиль;
		МенеджерЗаписи.Контрагент 	= ТекПеревозчик;
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мМассивМаршрутов = ЭтаФорма.Параметры.МассивМаршрутов;
	Для Каждого ТекМаршрут Из мМассивМаршрутов Цикл
		НоваяСтрока = ЭтаФорма.ТаблицаМаршрутов.Добавить();
		НоваяСтрока.Маршрут 	= ТекМаршрут;
		НоваяСтрока.Перевозчик 	= ТекМаршрут.Перевозчик;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаМаршрутовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы.ТаблицаМаршрутов.ТекущиеДанные;
	ТекДанные.Перевозчик = ПолучитьПеревозчикаМаршрута(ТекДанные.Маршрут);
	
КонецПроцедуры


&НаКлиенте
Процедура Установить(Команда)
	
	ПерезаписатьМаршруты();
	
	//
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
